[
  {
    "company": "Sainsbury's",
    "companyUrl": "https://www.sainsburys.co.uk/",
    "role": "Senior Software Engineer",
    "startDate": "06/2018",
    "endDate": "",
    "isCurrent": true,
    "description": [
      "As Front End Tech Lead of one of the teams in the marketing family, I’m responsible for shaping the direction of the Front End architecture of the products from inception to delivery with particular attention to the React landscape to improve the performance of the sites, reduce error rates and improve accessibility; with particular focus on tooling to increase automation and the developer experience in order to deliver more, faster and safer.",
      "As part of the leadership team of the family, I’m particularly involved in the interview process and in the community of practices, where I’m really active by collaborating, sharing and reaching out to other colleagues and teams."
    ],
    "techs": [
      "HTML5",
      "CSS3",
      "Javascript",
      "ES6",
      "TypeScript",
      "React",
      "Redux",
      "GraphQL",
      "Styled Components",
      "Serverless",
      "Lambda",
      "Webpack",
      "Git",
      "Agile"
    ]
  },
  {
    "company": "Sainsbury's",
    "companyUrl": "https://www.sainsburys.co.uk/",
    "role": "Software Engineer",
    "startDate": "06/2018",
    "endDate": "10/2019",
    "isCurrent": false,
    "description": [
      "Worked in an Agile team delivering a wide range of projects. As part of the Front End team, I focused on developing React web applications, with a high emphasis on performance and user experience. In order to achieve this, I have implemented a variety of technologies, tools, and services that have fulfilled those expectations and in many ways have lowered the cost and improved substantially the development experience, thus increasing the work delivery.",

      "In addition, I have worked closely with the Back End and Cloud team not only to expand my knowledge in those areas but also to apply solutions that improve my projects overall.",

      "Last but not least, I have been an integral part of the interview processes to expand my current team and the mentoring process for our graduates."
    ],
    "techs": [
      "HTML5",
      "CSS3",
      "Javascript",
      "ES6",
      "TypeScript",
      "React",
      "Redux",
      "GraphQL",
      "Styled Components",
      "Serverless",
      "Lambda",
      "Webpack",
      "Git",
      "Agile"
    ]
  },
  {
    "company": "Optimad",
    "companyUrl": "https://www.optimad.com/",
    "role": "Front End Developer",
    "startDate": "01/2018",
    "endDate": "05/2018",
    "isCurrent": false,
    "description": [
      "In charge of developing a new platform for the UK TV Broadcasters and Advertisement Media Outlets, implementing a modern front end setup, and designing and maintaining a comprehensive style guide for the project."
    ],
    "techs": [
      "HTML5",
      "CSS3",
      "Javascript",
      "ES6",
      "jQuery",
      "Git",
      "Gulp",
      "Webpack",
      "Agile",
      "Scrum",
      "Figma",
      "Balsamiq"
    ]
  },
  {
    "company": "Harrods",
    "companyUrl": "https://www.harrods.com/en-gb",
    "role": "Front End Developer",
    "startDate": "10/2016",
    "endDate": "01/2018",
    "isCurrent": false,
    "description": [
      "Developed and supported the main website with special focus in the checkout user journey using high standards of performance, responsiveness and accessibility. Created several internal tools to improve the efficiency of other departments’ workflows. Additionally I was responsible for the development of the email templates."
    ],
    "techs": [
      "HTML5",
      "CSS3",
      "Javascript",
      "ES6",
      "jQuery",
      "React",
      "Umbraco",
      "Git",
      "Grunt",
      "Gulp",
      "Webpack",
      "Agile",
      "Scrum"
    ]
  },
  {
    "company": "Penta Consulting",
    "companyUrl": "https://www.pentaconsulting.com/technology/",
    "role": "Front End Developer",
    "startDate": "06/2016",
    "endDate": "10/2016",
    "isCurrent": false,
    "description": [
      "Developed and supported legacy Wordpress theme designs. Worked alongside the design team to create mockups and implement them afterwards."
    ],
    "techs": [
      "HTML5",
      "CSS3",
      "Javascript",
      "jQuery",
      "Bootstrap",
      "Wordpress",
      "PHP",
      "Git",
      "Bitbucket",
      "Grunt",
      "Vagrant",
      "Agile",
      "Kanban"
    ]
  },
  {
    "company": "Hotel Ardora",
    "companyUrl": "https://ardora.es/",
    "role": "Front End Developer",
    "startDate": "02/2016",
    "endDate": "03/2016",
    "isCurrent": false,
    "description": null,
    "techs": ["HTML5", "CSS3", "Javascript", "jQuery", "Bootstrap", "SVGs"]
  },
  {
    "company": "MyMoneyPlatform",
    "companyUrl": "https://www.mymoneyplatform.com/",
    "role": "Front End Developer",
    "startDate": "09/2015",
    "endDate": "12/2015",
    "isCurrent": false,
    "description": [
      "Developed and supported the main web application alongside the front end team, focusing on the overall design and paying special attention to the responsive design for mobile devices."
    ],
    "techs": ["HTML5", "CSS3", "Javascript", "jQuery", "Bootstrap", "Wordpress"]
  }
]
